{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Trigonometry",
    "sub_topic": "Graphing trigonometric functions",
    "message_1": "A math student needs to graph the function y = 2sin(3x - π/2) over the interval [-2π, 2π].",
    "message_2": "To graph the function y = 2sin(3x - π/2) over the interval [-2π, 2π], we need to determine the amplitude, period, phase shift, and vertical shift of the function.\n\n1. Amplitude: The amplitude is the absolute value of the coefficient of the sine function, which in this case is 2. So, the amplitude is 2.\n\n2. Period: The period of the sine function is 2π divided by the absolute value of the coefficient of x inside the sine function. In this case, the coefficient of x is 3. So, the period is 2π/3.\n\n3. Phase Shift: The phase shift is determined by the value inside the sine function that is being subtracted or added to x. In this case, it is -π/2. To find the phase shift, we need to divide this value by the coefficient of x (which is 3) and then negate the result. So, the phase shift is (π/2)/3 = π/6 to the right.\n\n4. Vertical Shift: There is no vertical shift in this function, as there is no constant being added or subtracted outside the sine function.\n\nNow, we can graph the function using these characteristics:\n\n1. Start by drawing the x-axis and y-axis. Label the x-axis with the interval [-2π, 2π].\n\n2. Mark the amplitude on the y-axis, which is 2 and -2.\n\n3. Divide the x-axis into equal intervals according to the period. In this case, the period is 2π/3, so divide the x-axis into intervals of π/3.\n\n4. Plot the sine function with the phase shift. Since the phase shift is π/6 to the right, the sine function will start at x = π/6.\n\n5. Draw the sine wave with the amplitude of 2, period of 2π/3, and phase shift of π/6.\n\nThe graph of the function y = 2sin(3x - π/2) over the interval [-2π, 2π] will show a sine wave with an amplitude of 2, a period of 2π/3, and a phase shift of π/6 to the right."
}