{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Statistics",
    "sub_topic": "Central limit theorem",
    "message_1": "A factory produces light bulbs, and the weight of each light bulb is normally distributed with a mean weight of 50 grams and a standard deviation of 2 grams. What is the probability that the average weight of a sample of 25 light bulbs will be between 48.5 grams and 51.5 grams?",
    "message_2": "To solve this problem, we will use the Central Limit Theorem, which states that the distribution of the sample mean approaches a normal distribution as the sample size increases, regardless of the shape of the population distribution. In this case, we are given that the population distribution is already normal.\n\nGiven:\nPopulation mean (μ) = 50 grams\nPopulation standard deviation (σ) = 2 grams\nSample size (n) = 25 light bulbs\n\nFirst, we need to find the standard deviation of the sample mean (σ_sample_mean). This can be calculated using the formula:\n\nσ_sample_mean = σ / √n\n\nσ_sample_mean = 2 / √25\nσ_sample_mean = 2 / 5\nσ_sample_mean = 0.4 grams\n\nNow, we need to find the z-scores for the given range of sample mean weights (48.5 grams and 51.5 grams). The z-score is calculated using the formula:\n\nz = (x - μ) / σ_sample_mean\n\nFor the lower limit (48.5 grams):\nz1 = (48.5 - 50) / 0.4\nz1 = -1.5 / 0.4\nz1 = -3.75\n\nFor the upper limit (51.5 grams):\nz2 = (51.5 - 50) / 0.4\nz2 = 1.5 / 0.4\nz2 = 3.75\n\nNow, we need to find the probability that the sample mean weight lies between these z-scores. We can use a z-table or a calculator with a normal distribution function to find the probabilities corresponding to these z-scores.\n\nP(-3.75 < z < 3.75) = P(z < 3.75) - P(z < -3.75)\n\nUsing a z-table or calculator, we find:\nP(z < 3.75) ≈ 0.9999\nP(z < -3.75) ≈ 0.0001\n\nSo, the probability that the average weight of a sample of 25 light bulbs will be between 48.5 grams and 51.5 grams is:\n\nP(-3.75 < z < 3.75) = 0.9999 - 0.0001\nP(-3.75 < z < 3.75) = 0.9998\n\nTherefore, there is a 99.98% probability that the average weight of a sample of 25 light bulbs will be between 48.5 grams and 51.5 grams."
}