{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Statistics",
    "sub_topic": "Bayesian statistics",
    "message_1": "Here is a Bayesian statistics problem for a math student to solve:\n\nA factory produces light bulbs and advertises that their bulbs have a lifespan of at least 1000 hours. A sample of 50 bulbs is taken and it is found that the average lifespan is 1100 hours with a standard deviation of 100 hours. Using Bayesian inference, find the probability that a bulb produced by the factory will last at least 1200 hours. Assume a prior distribution for the true lifespan of the bulbs is normally distributed with a mean of 1000 hours and a standard deviation of 200 hours.",
    "message_2": "To solve this problem, we will use Bayesian inference to update our prior distribution based on the observed data and then calculate the probability that a bulb will last at least 1200 hours.\n\n1. Prior distribution: N(μ_prior, σ_prior^2) = N(1000, 200^2)\n2. Observed data: Sample mean (x̄) = 1100, Sample standard deviation (s) = 100, Sample size (n) = 50\n\nWe will now update our prior distribution using the observed data. The posterior distribution for the true mean lifespan of the bulbs (μ_posterior) is also normally distributed. The mean and variance of the posterior distribution can be calculated using the following formulas:\n\nμ_posterior = (σ_sample^2 * μ_prior + n * σ_prior^2 * x̄) / (σ_sample^2 + n * σ_prior^2)\nσ_posterior^2 = (σ_sample^2 * σ_prior^2) / (σ_sample^2 + n * σ_prior^2)\n\nwhere σ_sample^2 = s^2 / n\n\nPlugging in the values:\n\nσ_sample^2 = 100^2 / 50 = 200\nμ_posterior = (200 * 1000 + 50 * 200^2 * 1100) / (200 + 50 * 200^2) ≈ 1090.91\nσ_posterior^2 = (200 * 200^2) / (200 + 50 * 200^2) ≈ 3.92\n\nNow we have the posterior distribution: N(1090.91, 3.92)\n\nTo find the probability that a bulb will last at least 1200 hours, we need to find the probability that the true mean lifespan is at least 1200 hours given the posterior distribution. We can standardize the value and use the standard normal distribution (Z-distribution) to find the probability:\n\nZ = (1200 - μ_posterior) / sqrt(σ_posterior^2) = (1200 - 1090.91) / sqrt(3.92) ≈ 55.14\n\nUsing a Z-table or calculator, we find that the probability of a Z-score greater than 55.14 is essentially 0. Therefore, the probability that a bulb produced by the factory will last at least 1200 hours is approximately 0."
}