{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Statistics",
    "sub_topic": "Bayesian statistics",
    "message_1": "Suppose a company produces light bulbs and claims that the average lifespan of a light bulb is 1000 hours with a standard deviation of 100 hours. A sample of 50 light bulbs is selected and tested. Using the Bayesian approach, if the sample mean lifespan is 970 hours, what is the posterior probability that the true mean lifespan of the bulbs is between 980 and 990 hours?",
    "message_2": "To solve this problem using the Bayesian approach, we need to find the posterior distribution of the true mean lifespan given the sample mean. We'll assume that the prior distribution of the true mean lifespan is normally distributed with a mean of 1000 hours and a standard deviation of 100 hours. \n\nLet μ represent the true mean lifespan of the light bulbs, and let X̄ represent the sample mean. We are given:\n\nPrior distribution: P(μ) ~ N(1000, 100^2)\nSample mean: X̄ = 970 hours\nSample size: n = 50\n\nWe also know that the sampling distribution of the sample mean is normally distributed with a mean equal to the true mean (μ) and a standard deviation equal to the standard deviation of the population (σ) divided by the square root of the sample size (n):\n\nSampling distribution: P(X̄|μ) ~ N(μ, (100/sqrt(50))^2)\n\nNow, we can apply Bayes' theorem to find the posterior distribution of the true mean lifespan given the sample mean:\n\nPosterior distribution: P(μ|X̄) ∝ P(X̄|μ) * P(μ)\n\nSince both the prior distribution and the sampling distribution are normal, the posterior distribution will also be normal. To find the mean and standard deviation of the posterior distribution, we can use the following formulas:\n\nPosterior mean: μ_post = μ_prior + [(σ_prior^2) / (σ_prior^2 + σ_sample^2)] * (X̄ - μ_prior)\nPosterior standard deviation: σ_post = sqrt[(σ_prior^2 * σ_sample^2) / (σ_prior^2 + σ_sample^2)]\n\nPlugging in the given values:\n\nμ_prior = 1000\nσ_prior = 100\nσ_sample = 100/sqrt(50)\n\nμ_post = 1000 + [(100^2) / (100^2 + (100/sqrt(50))^2)] * (970 - 1000)\nμ_post ≈ 991.67\n\nσ_post = sqrt[(100^2 * (100/sqrt(50))^2) / (100^2 + (100/sqrt(50))^2)]\nσ_post ≈ 14.14\n\nSo, the posterior distribution is P(μ|X̄) ~ N(991.67, 14.14^2).\n\nNow, we want to find the probability that the true mean lifespan is between 980 and 990 hours:\n\nP(980 < μ < 990 | X̄) = Φ((990 - 991.67) / 14.14) - Φ((980 - 991.67) / 14.14)\n\nΦ represents the cumulative distribution function (CDF) of the standard normal distribution. Using a standard normal table or calculator:\n\nΦ((990 - 991.67) / 14.14) ≈ 0.5987\nΦ((980 - 991.67) / 14.14) ≈ 0.3015\n\nP(980 < μ < 990 | X̄) = 0.5987 - 0.3015 ≈ 0.2972\n\nSo, the posterior probability that the true mean lifespan of the bulbs is between 980 and 990 hours is approximately 29.72%."
}