{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Statistics",
    "sub_topic": "Central limit theorem",
    "message_1": "A manufacturing company produces light bulbs with a mean lifespan of 800 hours and a standard deviation of 50 hours. If a sample of 36 light bulbs are randomly selected, what is the probability that the sample mean lifespan will be between 790 and 810 hours?",
    "message_2": "To solve this problem, we will use the Central Limit Theorem, which states that the distribution of sample means will be approximately normally distributed with the same mean as the population and a standard deviation equal to the population standard deviation divided by the square root of the sample size.\n\nIn this case, the population mean (μ) is 800 hours, the population standard deviation (σ) is 50 hours, and the sample size (n) is 36.\n\nFirst, we need to find the standard deviation of the sample means, which is given by:\n\nσ_sample = σ / √n\nσ_sample = 50 / √36\nσ_sample = 50 / 6\nσ_sample = 8.3333 hours\n\nNow, we need to find the z-scores for the lower and upper bounds of the range we are interested in (790 and 810 hours).\n\nz_lower = (x_lower - μ) / σ_sample\nz_lower = (790 - 800) / 8.3333\nz_lower = -1.2\n\nz_upper = (x_upper - μ) / σ_sample\nz_upper = (810 - 800) / 8.3333\nz_upper = 1.2\n\nNow, we need to find the probability that the sample mean falls between these z-scores. We can do this by looking up the z-scores in a standard normal distribution table or using a calculator or software that can compute the cumulative probability.\n\nP(-1.2 < z < 1.2) = P(z < 1.2) - P(z < -1.2)\n\nUsing a standard normal distribution table or calculator, we find:\n\nP(z < 1.2) = 0.8849\nP(z < -1.2) = 0.1151\n\nNow, we can find the probability that the sample mean falls between 790 and 810 hours:\n\nP(790 < x < 810) = P(-1.2 < z < 1.2) = P(z < 1.2) - P(z < -1.2)\nP(790 < x < 810) = 0.8849 - 0.1151\nP(790 < x < 810) = 0.7698\n\nSo, the probability that the sample mean lifespan of the 36 light bulbs will be between 790 and 810 hours is approximately 76.98%."
}