{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Statistics",
    "sub_topic": "Hypothesis testing",
    "message_1": "A factory produces light bulbs that are supposed to have a mean life of at least 300 hours. The factory manager receives a complaint that the light bulbs burn out too quickly. The manager selects a random sample of 25 light bulbs and finds the sample mean life to be 295 hours with a sample standard deviation of 14 hours. \n\nDoes the sample data provide sufficient evidence to conclude that the factory's claim of a mean life of at least 300 hours is in question? Use a significance level of 0.05.",
    "message_2": "To determine if the sample data provides sufficient evidence to question the factory's claim, we will perform a one-sample t-test. The null hypothesis (H0) is that the true mean life of the light bulbs is at least 300 hours, and the alternative hypothesis (H1) is that the true mean life is less than 300 hours.\n\nH0: μ ≥ 300\nH1: μ < 300\n\nGiven data:\nSample size (n) = 25\nSample mean (x̄) = 295 hours\nSample standard deviation (s) = 14 hours\nSignificance level (α) = 0.05\n\nStep 1: Calculate the t-value.\nt = (x̄ - μ) / (s / √n)\n\nt = (295 - 300) / (14 / √25)\nt = -5 / (14 / 5)\nt = -5 / 2.8\nt ≈ -1.79\n\nStep 2: Determine the critical t-value.\nSince we are performing a one-tailed t-test with a significance level of 0.05 and 24 degrees of freedom (n - 1 = 25 - 1 = 24), we can look up the critical t-value in a t-distribution table or use a calculator.\n\nThe critical t-value for a one-tailed test with α = 0.05 and 24 degrees of freedom is approximately -1.71.\n\nStep 3: Compare the calculated t-value to the critical t-value.\nOur calculated t-value is -1.79, which is less than the critical t-value of -1.71.\n\nSince the calculated t-value is less than the critical t-value, we reject the null hypothesis. This means that there is sufficient evidence at the 0.05 significance level to conclude that the factory's claim of a mean life of at least 300 hours is in question."
}