{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Linear algebra",
    "sub_topic": "Solving linear programming problems using matrix methods",
    "message_1": "Here's a precise numerical problem for the student to solve:\n\nA company produces two products, X and Y, with the following requirements:\n\n- Each unit of X requires 2 hours of labor and 3 hours of machine time to produce, and sells for $100.\n- Each unit of Y requires 4 hours of labor and 2 hours of machine time to produce, and sells for $150.\n\nThe company has 100 hours of labor time and 80 hours of machine time available per week. How many units of X and Y should the company produce each week to maximize their profit?",
    "message_2": "To maximize the profit, we need to find the optimal combination of units of X and Y that the company should produce each week, given the constraints on labor and machine time. We can set up a linear programming problem to solve this.\n\nLet x be the number of units of product X and y be the number of units of product Y.\n\nObjective function (profit): P = 100x + 150y\n\nConstraints:\n1. Labor time: 2x + 4y ≤ 100\n2. Machine time: 3x + 2y ≤ 80\n3. Non-negativity: x ≥ 0, y ≥ 0\n\nFirst, we'll find the feasible region by solving the constraint inequalities:\n\n1. 2x + 4y ≤ 100\nDivide both sides by 2: x + 2y ≤ 50\ny ≤ (50 - x)/2\n\n2. 3x + 2y ≤ 80\ny ≤ (80 - 3x)/2\n\nNow we'll find the vertices of the feasible region by solving the systems of equations formed by the constraint equalities:\n\n1. Intersection of labor and machine time constraints:\nx + 2y = 50\n3x + 2y = 80\n\nSubtract the first equation from the second:\n2x = 30\nx = 15\n\nSubstitute x back into the first equation:\n15 + 2y = 50\n2y = 35\ny = 17.5\n\nVertex A: (15, 17.5)\n\n2. Intersection of labor constraint and x-axis (y = 0):\nx + 2(0) = 50\nx = 50\n\nVertex B: (50, 0)\n\n3. Intersection of machine constraint and y-axis (x = 0):\n3(0) + 2y = 80\n2y = 80\ny = 40\n\nVertex C: (0, 40)\n\nNow we'll evaluate the objective function (profit) at each vertex:\n\nP(A) = 100(15) + 150(17.5) = 1500 + 2625 = $4125\nP(B) = 100(50) + 150(0) = 5000 + 0 = $5000\nP(C) = 100(0) + 150(40) = 0 + 6000 = $6000\n\nThe maximum profit occurs at vertex C, where the company produces 0 units of product X and 40 units of product Y. The maximum profit is $6000 per week."
}