{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Game theory",
    "sub_topic": "Principal-Agent Problem",
    "message_1": "Sure, here's a numerical problem for a math student to solve:\n\nThe manager of a restaurant desires to motivate their server to provide excellent service to all customers. The server can either provide high-quality service or low-quality service to a customer, but the manager cannot directly observe the service provided. The manager's effort in monitoring the server's performance is costly. If the server provides high-quality service, the manager will make a profit of $400, but if low-quality service is provided, the manager will make a profit of $200. The server knows this but is not highly motivated to provide excellent service since they do not receive any additional compensation. The manager offers a bonus to the server that is based on their level of service. If the server provides high-quality service, they will receive an additional payment of $100. If they provide low-quality service, they will receive no additional payment. If monitoring the server costs $50, what is the expected profit of the manager if the server decides to provide high-quality service? And what is the expected profit of the manager if the server decides to provide low-quality service?",
    "message_2": "If the server decides to provide high-quality service, the manager will make a profit of $400. However, the manager has to pay the server a bonus of $100 for providing high-quality service and also spend $50 on monitoring the server's performance. So, the expected profit of the manager in this case would be:\n\nExpected profit (high-quality service) = $400 (profit) - $100 (bonus) - $50 (monitoring cost) = $250\n\nIf the server decides to provide low-quality service, the manager will make a profit of $200. Since the server does not receive any additional payment for providing low-quality service, the manager only has to spend $50 on monitoring the server's performance. So, the expected profit of the manager in this case would be:\n\nExpected profit (low-quality service) = $200 (profit) - $0 (bonus) - $50 (monitoring cost) = $150\n\nTherefore, the expected profit of the manager is $250 if the server decides to provide high-quality service and $150 if the server decides to provide low-quality service."
}