{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Group theory",
    "sub_topic": "Prove that every group of prime order is cyclic.",
    "message_1": "Find a cyclic group of prime order and prove that every group of that prime order is isomorphic to this cyclic group.",
    "message_2": "Let's consider a cyclic group of prime order p, denoted by Z_p. This group is generated by a single element, say g, and its elements are {1, g, g^2, ..., g^(p-1)}. The group operation is multiplication modulo p.\n\nNow, let's consider an arbitrary group G of order p. Since p is prime, by Lagrange's theorem, the order of any non-identity element in G must divide p. The only divisors of p are 1 and p itself. Thus, any non-identity element in G must have order p.\n\nLet's pick an arbitrary non-identity element h in G. Since h has order p, the subgroup generated by h, denoted by <h>, must have p elements: {1, h, h^2, ..., h^(p-1)}. Since G has p elements and <h> has p elements, we can conclude that G = <h>.\n\nNow, we will define a function φ: Z_p → G such that φ(g^i) = h^i for all 0 ≤ i ≤ p-1. We will show that φ is an isomorphism between Z_p and G.\n\n1. φ is well-defined: Since g has order p in Z_p and h has order p in G, the powers of g in Z_p correspond to the powers of h in G. Thus, φ is well-defined.\n\n2. φ is a homomorphism: Let g^i, g^j ∈ Z_p. Then, φ(g^i * g^j) = φ(g^(i+j)) = h^(i+j) = h^i * h^j = φ(g^i) * φ(g^j). Thus, φ preserves the group operation.\n\n3. φ is injective (one-to-one): Suppose φ(g^i) = φ(g^j) for some 0 ≤ i, j ≤ p-1. Then, h^i = h^j. Since h has order p, this implies that i ≡ j (mod p). Thus, φ is injective.\n\n4. φ is surjective (onto): Since G = <h> and φ maps g^i to h^i for all 0 ≤ i ≤ p-1, every element of G is the image of some element in Z_p under φ. Thus, φ is surjective.\n\nSince φ is a well-defined homomorphism that is both injective and surjective, it is an isomorphism between Z_p and G. Therefore, every group of prime order p is isomorphic to the cyclic group Z_p."
}