{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Non-convex optimization",
    "message_1": "A manufacturing company produces two types of bicycle frames: Road and Mountain. The Road frame requires 3 hours of welding, 2 hours of painting and 1 hour of polishing. The Mountain frame requires 2 hours of welding, 4 hours of painting and 3 hours of polishing. The company has 220 hours of welding time, 200 hours of painting time and 120 hours of polishing time available per week. The profit of each Road frame is $100 and each Mountain frame is $150. How many of each frame should the company produce per week to maximize their profit?",
    "message_2": "Let x be the number of Road frames and y be the number of Mountain frames produced per week.\n\nThe constraints for the available hours per week are as follows:\n\nWelding: 3x + 2y ≤ 220\nPainting: 2x + 4y ≤ 200\nPolishing: x + 3y ≤ 120\nx ≥ 0, y ≥ 0 (since we cannot produce a negative number of frames)\n\nThe objective function to maximize the profit is:\n\nProfit = 100x + 150y\n\nTo solve this linear programming problem, we will find the feasible region determined by the constraints and then evaluate the objective function at each vertex of the feasible region.\n\nFirst, we'll rewrite the constraints as equations to find the intersection points:\n\n1) 3x + 2y = 220\n2) 2x + 4y = 200\n3) x + 3y = 120\n\nSolving the system of equations:\n\n1) and 2):\n3x + 2y = 220\n2x + 4y = 200\n\nDivide the second equation by 2:\nx + 2y = 100\n\nSubtract the new second equation from the first equation:\n2x = 20\nx = 10\n\nSubstitute x back into the new second equation:\n10 + 2y = 100\n2y = 90\ny = 45\n\nIntersection point A (10, 45)\n\n1) and 3):\n3x + 2y = 220\nx + 3y = 120\n\nSubtract the second equation from the first equation:\n2x - y = 100\ny = 2x - 100\n\nSubstitute y back into the second equation:\nx + 3(2x - 100) = 120\nx + 6x - 300 = 120\n7x = 420\nx = 60\n\nSubstitute x back into the equation for y:\ny = 2(60) - 100\ny = 20\n\nIntersection point B (60, 20)\n\n2) and 3):\n2x + 4y = 200\nx + 3y = 120\n\nMultiply the second equation by 2:\n2x + 6y = 240\n\nSubtract the first equation from the new second equation:\n2y = 40\ny = 20\n\nSubstitute y back into the second equation:\nx + 3(20) = 120\nx = 120 - 60\nx = 60\n\nIntersection point C (60, 20) (same as point B)\n\nNow we have the vertices of the feasible region: A (10, 45), B (60, 20), and the origin (0, 0).\n\nEvaluate the profit function at each vertex:\n\nP(A) = 100(10) + 150(45) = 1000 + 6750 = $7,750\nP(B) = 100(60) + 150(20) = 6000 + 3000 = $9,000\nP(0, 0) = 100(0) + 150(0) = $0\n\nThe maximum profit occurs at point B (60, 20), producing 60 Road frames and 20 Mountain frames per week, with a total profit of $9,000."
}