{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Combinatorial optimization",
    "message_1": "Here's a problem for the student to solve from Combinatorial Optimization:\n\nA company produces three products: A, B, and C. The selling price of product A is $50, product B is $75, and product C is $100. Each product requires a certain amount of time to be produced, and the total available production time per week is 80 hours. The production times for each product are as follows:\n\nProduct A: 5 hours\nProduct B: 8 hours\nProduct C: 12 hours\n\nAssuming the company wants to maximize its weekly income, how many units of each product should it produce per week?",
    "message_2": "To solve this problem, we can use linear programming. Let x, y, and z represent the number of units produced for products A, B, and C, respectively. The objective function to maximize is the total income:\n\nTotal Income = 50x + 75y + 100z\n\nSubject to the constraint of the total available production time per week:\n\n5x + 8y + 12z ≤ 80\n\nAnd the non-negativity constraints:\n\nx ≥ 0\ny ≥ 0\nz ≥ 0\n\nNow, we can solve this linear programming problem using the simplex method or any other optimization technique. However, since the problem is relatively small, we can also solve it by checking integer solutions within the feasible region.\n\nFirst, we find the maximum possible number of units for each product:\n\nx_max = 80 / 5 = 16\ny_max = 80 / 8 = 10\nz_max = 80 / 12 ≈ 6.67 (rounded down to 6)\n\nNow, we can check all possible combinations of x, y, and z within these limits, and calculate the total income for each combination. After checking all the combinations, we find that the maximum total income is achieved when x = 8, y = 6, and z = 0, with a total income of:\n\n50(8) + 75(6) + 100(0) = 400 + 450 = $850\n\nSo, the company should produce 8 units of product A, 6 units of product B, and 0 units of product C per week to maximize its weekly income."
}