{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Global optimization",
    "message_1": "A company produces two products - Product A and Product B. The profit per unit of Product A is $10 and the profit per unit of Product B is $15. The production of Product A requires 2 hours of labor and 3 hours of machine time while the production of Product B requires 5 hours of labor and 4 hours of machine time. The company has 100 hours of labor time and 80 hours of machine time available in a week. How many units of each product should the company produce in a week to maximize their profit?",
    "message_2": "Let x be the number of units of Product A and y be the number of units of Product B.\n\nThe objective function to maximize the profit is:\nP = 10x + 15y\n\nThe constraints are given by the available labor and machine time:\n2x + 5y ≤ 100 (labor time constraint)\n3x + 4y ≤ 80 (machine time constraint)\nx ≥ 0, y ≥ 0 (non-negativity constraint)\n\nFirst, we will find the feasible region by graphing the constraints:\n\n1. 2x + 5y ≤ 100\ny ≤ (100 - 2x) / 5\n\n2. 3x + 4y ≤ 80\ny ≤ (80 - 3x) / 4\n\nThe feasible region is the area where both inequalities are satisfied, and x and y are non-negative.\n\nNow, we will find the corner points of the feasible region:\n1. Intersection of 2x + 5y = 100 and 3x + 4y = 80\nSolving the system of equations:\n\n2x + 5y = 100\n3x + 4y = 80\n\nMultiplying the first equation by 3 and the second equation by 2, we get:\n\n6x + 15y = 300\n6x + 8y = 160\n\nSubtracting the second equation from the first:\n\n7y = 140\ny = 20\n\nSubstituting y back into the first equation:\n\n2x + 5(20) = 100\n2x + 100 = 100\n2x = 0\nx = 0\n\nSo, the intersection point is (0, 20).\n\n2. Intersection of 2x + 5y = 100 and x = 0\ny = (100 - 2(0)) / 5\ny = 20\n\nThe intersection point is (0, 20).\n\n3. Intersection of 3x + 4y = 80 and y = 0\nx = (80 - 4(0)) / 3\nx = 80 / 3 ≈ 26.67\n\nSince x must be a whole number, we round down to x = 26.\n\nThe intersection point is (26, 0).\n\nNow, we will evaluate the profit function at each corner point:\n\nP(0, 20) = 10(0) + 15(20) = 300\nP(0, 0) = 10(0) + 15(0) = 0\nP(26, 0) = 10(26) + 15(0) = 260\n\nThe maximum profit is $300 when producing 0 units of Product A and 20 units of Product B."
}