{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Optimal scheduling",
    "message_1": "A manufacturing company produces two types of products P1 and P2. The production of P1 requires 2 hours of machine time and 3 hours of labor time while the production of P2 requires 4 hours of machine time and 1 hour of labor time. The company has a total of 50 hours of machine time and 60 hours of labor time available per week. Each unit of P1 sells for $10 and each unit of P2 sells for $15. Determine how many units of each product should the company produce in order to maximize their weekly profit.",
    "message_2": "Let x be the number of units of P1 produced and y be the number of units of P2 produced.\n\nThe constraints for machine time and labor time can be represented as linear inequalities:\n\nMachine time: 2x + 4y ≤ 50\nLabor time: 3x + y ≤ 60\n\nWe also have non-negativity constraints:\nx ≥ 0\ny ≥ 0\n\nThe objective function to maximize the profit is:\nProfit = 10x + 15y\n\nFirst, we'll solve the constraint inequalities for the feasible region:\n\n1. 2x + 4y ≤ 50\nDivide by 2:\nx + 2y ≤ 25\ny ≥ (25 - x) / 2\n\n2. 3x + y ≤ 60\ny ≤ 60 - 3x\n\nNow we'll find the vertices of the feasible region by solving the systems of equations formed by the constraint inequalities:\n\nVertex 1: Intersection of x + 2y = 25 and 3x + y = 60\nx + 2y = 25\n3x + y = 60\n\nSolve for x:\nx = 25 - 2y\n\nSubstitute into the second equation:\n3(25 - 2y) + y = 60\n75 - 6y + y = 60\n-5y = -15\ny = 3\n\nx = 25 - 2(3) = 19\n\nVertex 1: (19, 3)\n\nVertex 2: Intersection of x + 2y = 25 and y = 0\nx + 2y = 25\nx + 2(0) = 25\nx = 25\n\nVertex 2: (25, 0)\n\nVertex 3: Intersection of 3x + y = 60 and y = 0\n3x + y = 60\n3x + 0 = 60\nx = 20\n\nVertex 3: (20, 0)\n\nNow we'll evaluate the profit function at each vertex:\n\nProfit at Vertex 1: 10(19) + 15(3) = 190 + 45 = $235\nProfit at Vertex 2: 10(25) + 15(0) = 250 + 0 = $250\nProfit at Vertex 3: 10(20) + 15(0) = 200 + 0 = $200\n\nThe maximum profit occurs at Vertex 2, where the company produces 25 units of P1 and 0 units of P2. The maximum weekly profit is $250."
}