{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Global optimization",
    "message_1": "A manufacturing company produces two types of widgets. Type A widgets sell for $6 each and Type B widgets sell for $8 each. The company's production process has a fixed capacity of 100 units per day, and it takes 1 hour to produce each Type A widget and 2 hours to produce each Type B widget. The company earns a profit of $2 for each Type A widget sold and $3 for each Type B widget sold.\n\nThe question for the math student to solve is: How many units of each type of widget should the company produce per day in order to maximize profit?",
    "message_2": "Let x be the number of Type A widgets produced and y be the number of Type B widgets produced.\n\nWe have two constraints:\n\n1. The total number of widgets produced cannot exceed 100 units per day: x + y ≤ 100\n2. The total production time cannot exceed 100 hours per day: 1x + 2y ≤ 100\n\nWe want to maximize the profit function P(x, y) = 2x + 3y.\n\nTo solve this problem, we can use the method of linear programming. First, we'll find the feasible region by graphing the constraints:\n\n1. x + y ≤ 100\n   y ≤ 100 - x\n\n2. 1x + 2y ≤ 100\n   y ≤ (100 - x) / 2\n\nThe feasible region is the area enclosed by the two lines y = 100 - x and y = (100 - x) / 2, and the axes x = 0 and y = 0.\n\nNow we need to find the vertices of the feasible region:\n\n1. Intersection of y = 100 - x and y = (100 - x) / 2:\n   100 - x = (100 - x) / 2\n   2(100 - x) = 100 - x\n   200 - 2x = 100 - x\n   x = 100\n\n   y = 100 - x = 100 - 100 = 0\n\n   Vertex A: (100, 0)\n\n2. Intersection of y = 100 - x and x = 0:\n   y = 100 - 0 = 100\n\n   Vertex B: (0, 100)\n\n3. Intersection of y = (100 - x) / 2 and x = 0:\n   y = (100 - 0) / 2 = 50\n\n   Vertex C: (0, 50)\n\n4. Intersection of y = (100 - x) / 2 and y = 0:\n   0 = (100 - x) / 2\n   x = 100\n\n   Vertex D: (100, 0)\n\nNotice that Vertex A and Vertex D are the same point. So, we have three vertices: A (100, 0), B (0, 100), and C (0, 50).\n\nNow we'll evaluate the profit function P(x, y) = 2x + 3y at each vertex:\n\n1. P(100, 0) = 2(100) + 3(0) = 200\n2. P(0, 100) = 2(0) + 3(100) = 300\n3. P(0, 50) = 2(0) + 3(50) = 150\n\nThe maximum profit occurs at vertex B (0, 100), with a profit of $300. Therefore, the company should produce 0 units of Type A widgets and 100 units of Type B widgets per day to maximize profit."
}