{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Robust optimization",
    "message_1": "Here is a numerical problem related to robust optimization in mathematics:\n\nA manufacturer produces two types of smartphones, A and B. The profit from each phone is $30 for type A and $50 for type B. The manufacturer has a total of 200 hours of labor available per day for production. Each unit of type A requires 2 hours of labor, and each unit of type B requires 4 hours of labor. The manufacturer expects that there is a 10% chance of a labor shortage on any given day. What is the optimal production plan to maximize profit, to ensure that even if there is a shortage, at least 80% of the expected demand for each type of phone is met? \n\nAsk the student to determine the number of units of each type that should be produced per day to maximize profit, along with the expected profit under the given conditions.",
    "message_2": "Let x be the number of units of type A smartphones produced per day, and y be the number of units of type B smartphones produced per day. The labor constraint can be written as:\n\n2x + 4y ≤ 200\n\nWe also need to ensure that at least 80% of the expected demand for each type of phone is met, even if there is a labor shortage. Let's assume that the labor shortage reduces the available labor by 10%, which means that there will be 180 hours of labor available on those days. The constraint for this scenario is:\n\n2x + 4y ≤ 180\n\nNow, we need to maximize the profit function:\n\nProfit = 30x + 50y\n\nTo solve this linear programming problem, we can graph the constraints and find the feasible region. Then, we can find the vertices of the feasible region and evaluate the profit function at each vertex to determine the optimal production plan.\n\nThe feasible region is defined by the intersection of the two constraints:\n\n2x + 4y ≤ 200\n2x + 4y ≤ 180\n\nThe vertices of the feasible region are (0, 45), (0, 50), (90, 0), and (80, 0).\n\nNow, we evaluate the profit function at each vertex:\n\nProfit(0, 45) = 30(0) + 50(45) = $2250\nProfit(0, 50) = 30(0) + 50(50) = $2500\nProfit(90, 0) = 30(90) + 50(0) = $2700\nProfit(80, 0) = 30(80) + 50(0) = $2400\n\nThe maximum profit is achieved when producing 90 units of type A smartphones and 0 units of type B smartphones, with an expected profit of $2700 per day."
}