{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Linear programming",
    "message_1": "A furniture manufacturer produces two types of chairs: a wooden chair that requires 10 hours of labor and 8 square feet of wood, and a leather chair that requires 8 hours of labor and 10 square feet of leather. The manufacturer has 80 hours of labor and 100 square feet of wood available each week, and 60 hours of labor and 80 square feet of leather available each week. If the manufacturer makes a profit of $50 for each wooden chair and $70 for each leather chair, how many of each chair should be produced each week to maximize profit?",
    "message_2": "Let x be the number of wooden chairs and y be the number of leather chairs produced each week.\n\nThe constraints for labor and materials are as follows:\n\nLabor for wooden chairs: 10x\nLabor for leather chairs: 8y\nTotal labor available: 80 hours\n\nWood for wooden chairs: 8x\nTotal wood available: 100 square feet\n\nLabor for leather chairs: 8y\nTotal labor available: 60 hours\n\nLeather for leather chairs: 10y\nTotal leather available: 80 square feet\n\nThe constraints can be written as:\n\n10x + 8y ≤ 80 (labor constraint)\n8x ≤ 100 (wood constraint)\n8y ≤ 60 (labor constraint for leather chairs)\n10y ≤ 80 (leather constraint)\n\nThe objective function to maximize profit is:\n\nP = 50x + 70y\n\nFirst, we'll find the feasible region by solving the constraints for x and y:\n\nx ≥ 0\ny ≥ 0\n10x + 8y ≤ 80\n8x ≤ 100 => x ≤ 12.5\n8y ≤ 60 => y ≤ 7.5\n10y ≤ 80 => y ≤ 8\n\nThe feasible region is defined by the intersection of these inequalities. The corner points of the feasible region are:\n\nA(0, 0)\nB(0, 7.5)\nC(12.5, 0)\nD(5, 5)\n\nNow, we'll evaluate the objective function at each corner point:\n\nP(A) = 50(0) + 70(0) = $0\nP(B) = 50(0) + 70(7.5) = $525\nP(C) = 50(12.5) + 70(0) = $625\nP(D) = 50(5) + 70(5) = $600\n\nThe maximum profit occurs at point C, where 12.5 wooden chairs and 0 leather chairs are produced. Since the manufacturer cannot produce a fraction of a chair, they should produce 12 wooden chairs and 0 leather chairs each week to maximize profit, resulting in a profit of $600."
}