{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Integer programming",
    "message_1": "A furniture company specializes in producing tables and chairs. The company has 600 hours of labor available per week and 3500 square feet of wood available per week. A table requires 3 hours of labor and 20 square feet of wood while a chair requires 2 hours of labor and 15 square feet of wood. The company makes a profit of $50 on a table and $30 on a chair. How many tables and chairs should be produced in order to maximize the profit?",
    "message_2": "Let x be the number of tables and y be the number of chairs produced.\n\nThe constraints for labor and wood availability are as follows:\n\nLabor: 3x + 2y ≤ 600\nWood: 20x + 15y ≤ 3500\n\nThe objective function to maximize the profit is:\n\nProfit = 50x + 30y\n\nFirst, we need to find the feasible region by solving the constraint inequalities:\n\n1) 3x + 2y ≤ 600\n2y ≤ -3x + 600\ny ≤ (-3/2)x + 300\n\n2) 20x + 15y ≤ 3500\n15y ≤ -20x + 3500\ny ≤ (-4/3)x + 700/3\n\nNow we need to find the vertices of the feasible region:\n\n1) Intersection of the two lines:\n(-3/2)x + 300 = (-4/3)x + 700/3\n(1/6)x = 100/3\nx = 200\n\ny = (-3/2)(200) + 300 = 100\n\n2) Intersection of the labor constraint with the x-axis (y = 0):\n3x + 2(0) ≤ 600\nx = 200\n\n3) Intersection of the wood constraint with the x-axis (y = 0):\n20x + 15(0) ≤ 3500\nx = 175\n\n4) Intersection of the labor constraint with the y-axis (x = 0):\n3(0) + 2y ≤ 600\ny = 300\n\n5) Intersection of the wood constraint with the y-axis (x = 0):\n20(0) + 15y ≤ 3500\ny = 700/3\n\nNow we need to test the vertices in the objective function to find the maximum profit:\n\n1) (200, 100)\nProfit = 50(200) + 30(100) = 10000 + 3000 = $13,000\n\n2) (200, 0)\nProfit = 50(200) + 30(0) = 10000 + 0 = $10,000\n\n3) (175, 0)\nProfit = 50(175) + 30(0) = 8750 + 0 = $8,750\n\n4) (0, 300)\nProfit = 50(0) + 30(300) = 0 + 9000 = $9,000\n\n5) (0, 700/3)\nProfit = 50(0) + 30(700/3) = 0 + 7000 = $7,000\n\nThe maximum profit of $13,000 is achieved when the company produces 200 tables and 100 chairs."
}