{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Integer programming",
    "message_1": "A company produces two types of furniture: chairs and tables. The production of one chair requires 3 units of wood, 2 units of metal, and 1 unit of upholstery, whereas the production of one table requires 4 units of wood, 3 units of metal, and 2 units of upholstery. \nThe company has 400 units of wood, 300 units of metal, and 160 units of upholstery available. \nIf the profit from selling one chair is $20, and the profit from selling one table is $30, how many chairs and tables should the company produce to maximize profit?",
    "message_2": "Let x be the number of chairs and y be the number of tables produced.\n\nThe constraints for the available resources are as follows:\n\nWood: 3x + 4y ≤ 400\nMetal: 2x + 3y ≤ 300\nUpholstery: x + 2y ≤ 160\n\nWe want to maximize the profit function P(x, y) = 20x + 30y.\n\nFirst, we will find the feasible region by solving the inequalities:\n\n1. 3x + 4y ≤ 400\ny ≤ (400 - 3x) / 4\n\n2. 2x + 3y ≤ 300\ny ≤ (300 - 2x) / 3\n\n3. x + 2y ≤ 160\ny ≤ (160 - x) / 2\n\nSince x and y must be non-negative, we have the following constraints:\nx ≥ 0\ny ≥ 0\n\nNow, we will find the vertices of the feasible region by solving the systems of equations formed by the intersections of the constraint lines:\n\nIntersection of (1) and (2):\n3x + 4y = 400\n2x + 3y = 300\n\nSolving this system, we get x = 40 and y = 70.\n\nIntersection of (1) and (3):\n3x + 4y = 400\nx + 2y = 160\n\nSolving this system, we get x = 80 and y = 40.\n\nIntersection of (2) and (3):\n2x + 3y = 300\nx + 2y = 160\n\nSolving this system, we get x = 60 and y = 50.\n\nNow, we will evaluate the profit function P(x, y) at each of these vertices:\n\nP(40, 70) = 20(40) + 30(70) = 800 + 2100 = 2900\nP(80, 40) = 20(80) + 30(40) = 1600 + 1200 = 2800\nP(60, 50) = 20(60) + 30(50) = 1200 + 1500 = 2700\n\nThe maximum profit occurs when producing 40 chairs and 70 tables, resulting in a profit of $2900."
}