{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Mixed-integer programming",
    "message_1": "A company produces two products, A and B. The production process requires machine time and labour time. The total available machine time per week is 500 hours, while the total available labour hours per week are 450 hours. Product A requires 3 hours of machine time and 2 hours of labour time to produce, while Product B requires 2 hours of machine time and 3 hours of labour time to produce. Each unit of Product A yields a profit of $60, while each unit of Product B yields a profit of $50. How many units of Product A and B should the company produce per week to maximize their total profit? Note that the company can only produce integer units of the products, i.e., they can't produce a fraction of a unit.",
    "message_2": "Let x be the number of units of Product A produced and y be the number of units of Product B produced. We have the following constraints:\n\n3x + 2y ≤ 500 (machine time constraint)\n2x + 3y ≤ 450 (labour time constraint)\nx ≥ 0, y ≥ 0 (non-negativity constraint)\n\nThe objective function to maximize is the total profit, P = 60x + 50y.\n\nFirst, we'll find the feasible region by graphing the constraints:\n\n1. 3x + 2y ≤ 500\ny ≤ (500 - 3x)/2\n\n2. 2x + 3y ≤ 450\ny ≤ (450 - 2x)/3\n\nThe feasible region is the area where both inequalities are satisfied. We'll find the vertices of the feasible region by solving the equations at the intersection points:\n\n1. Intersection of 3x + 2y = 500 and 2x + 3y = 450:\nx = 100, y = 50\n\n2. Intersection of 3x + 2y = 500 and x = 0:\nx = 0, y = 250\n\n3. Intersection of 2x + 3y = 450 and y = 0:\nx = 225, y = 0\n\nNow, we'll evaluate the objective function P = 60x + 50y at each vertex:\n\n1. P(100, 50) = 60(100) + 50(50) = 6000 + 2500 = 8500\n2. P(0, 250) = 60(0) + 50(250) = 0 + 12500 = 12500\n3. P(225, 0) = 60(225) + 50(0) = 13500 + 0 = 13500\n\nThe maximum profit occurs when producing 225 units of Product A and 0 units of Product B, with a total profit of $13,500."
}