{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Integer programming",
    "message_1": "Here's an example problem for an Integer Programming student to solve:\n\nA furniture manufacturer needs to optimize their production schedule for two types of chairs: a wooden chair that sells for $50, and a metal chair that sells for $70. The manufacturer has 500 hours of production time available for both types of chairs. The wooden chair requires 3 hours to produce, while the metal chair requires 5 hours. The manufacturer has enough materials to produce up to 90 chairs of either type. What is the maximum profit the manufacturer can make if they can only produce whole numbers of chairs?",
    "message_2": "Let x be the number of wooden chairs and y be the number of metal chairs.\n\nObjective function (profit): P = 50x + 70y\n\nConstraints:\n1. Production time: 3x + 5y ≤ 500\n2. Maximum chairs: x + y ≤ 90\n3. Non-negativity: x ≥ 0, y ≥ 0\n\nFirst, we'll find the feasible region by solving the constraint inequalities:\n\n1. 3x + 5y ≤ 500\ny ≤ (500 - 3x) / 5\n\n2. x + y ≤ 90\ny ≤ 90 - x\n\nNow, we'll find the vertices of the feasible region by solving the system of equations formed by the intersection of the constraint lines:\n\nA. Intersection of constraint 1 and 2:\n3x + 5y = 500\nx + y = 90\n\nSolving this system of equations:\nx = 90 - y\n3(90 - y) + 5y = 500\n270 - 3y + 5y = 500\n2y = 230\ny = 115\n\nSince y > 90, this intersection point is not in the feasible region.\n\nB. Intersection of constraint 1 and x-axis (y = 0):\n3x + 5(0) = 500\nx = 166.67\n\nSince x > 90, this intersection point is not in the feasible region.\n\nC. Intersection of constraint 2 and y-axis (x = 0):\n0 + y = 90\ny = 90\n\nD. Intersection of constraint 1 and constraint 2 with x = 90:\n3(90) + 5y = 500\ny = 20\n\nSo, the feasible region has two vertices: C(0, 90) and D(90, 20).\n\nNow, we'll evaluate the objective function at these vertices:\n\nP(C) = 50(0) + 70(90) = 0 + 6300 = 6300\nP(D) = 50(90) + 70(20) = 4500 + 1400 = 5900\n\nSince P(C) > P(D), the maximum profit is $6,300, which occurs when the manufacturer produces 0 wooden chairs and 90 metal chairs."
}