{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Linear programming",
    "message_1": "A mattress company produces two types of mattresses, Deluxe and Supreme. The Deluxe mattress requires 3 hours of labour for cutting and sewing and 2 hours for finishing, while the Supreme requires 2 hours of labour for cutting and sewing and 1 hour for finishing. The Deluxe mattress earns a profit of $150 while the Supreme mattress earns a profit of $100. The company has 120 hours of labour available for cutting and sewing and 80 hours of labour available for finishing. How many of each type of mattress should the company produce to maximize its profit?",
    "message_2": "Let x be the number of Deluxe mattresses and y be the number of Supreme mattresses.\n\nThe labour constraints for cutting and sewing can be represented as:\n3x + 2y ≤ 120 (1)\n\nThe labour constraints for finishing can be represented as:\n2x + y ≤ 80 (2)\n\nWe want to maximize the profit function P(x, y) = 150x + 100y.\n\nFirst, we need to find the feasible region by solving the system of inequalities (1) and (2).\n\nFrom inequality (1), we can isolate y:\ny ≤ (120 - 3x) / 2\n\nFrom inequality (2), we can isolate y:\ny ≤ 80 - 2x\n\nNow, we need to find the vertices of the feasible region. We can do this by finding the points where the inequalities intersect.\n\nIntersection of (1) and (2):\n3x + 2y = 120\n2x + y = 80\n\nSolving this system of equations, we get:\nx = 20\ny = 40\n\nSo, one vertex of the feasible region is (20, 40).\n\nIntersection of (1) and y-axis (x = 0):\n3x + 2y = 120\n3(0) + 2y = 120\ny = 60\n\nSo, another vertex of the feasible region is (0, 60).\n\nIntersection of (2) and x-axis (y = 0):\n2x + y = 80\n2x + 0 = 80\nx = 40\n\nSo, another vertex of the feasible region is (40, 0).\n\nNow, we need to evaluate the profit function P(x, y) = 150x + 100y at each vertex:\n\nP(20, 40) = 150(20) + 100(40) = 3000 + 4000 = 7000\nP(0, 60) = 150(0) + 100(60) = 0 + 6000 = 6000\nP(40, 0) = 150(40) + 100(0) = 6000 + 0 = 6000\n\nThe maximum profit is $7000 when producing 20 Deluxe mattresses and 40 Supreme mattresses."
}