{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Mixed-integer programming",
    "message_1": "A company wants to produce at least 200 units of two products, A and B. The production time for each unit of product A is 2 hours, and for each unit of product B is 1 hour. The company has 400 hours of available production time. \n\nAdditionally, the company must use at least 40% of the available production time on product A. The profit per unit of product A is $100 and for product B is $50. \n\nWhat is the optimal production plan to maximize the company's profit?",
    "message_2": "Let x be the number of units of product A and y be the number of units of product B.\n\nWe have the following constraints:\n\n1. Production time constraint: 2x + y ≤ 400 (since each unit of A takes 2 hours and each unit of B takes 1 hour)\n2. Minimum production constraint: x + y ≥ 200 (since the company wants to produce at least 200 units)\n3. Minimum production time for product A constraint: x ≥ 0.4 * 400 / 2 = 80 (since at least 40% of the available production time must be used for product A)\n\nThe objective function to maximize the profit is:\n\nProfit = 100x + 50y\n\nNow, we need to find the values of x and y that satisfy the constraints and maximize the profit.\n\nFirst, let's find the intersection points of the constraints:\n\n1. Intersection of constraint 1 and 2: 2x + y = 400 and x + y = 200\n   Solving these equations, we get x = 100 and y = 100.\n\n2. Intersection of constraint 1 and 3: 2x + y = 400 and x = 80\n   Substituting x = 80, we get y = 240.\n\n3. Intersection of constraint 2 and 3: x + y = 200 and x = 80\n   Substituting x = 80, we get y = 120.\n\nNow, we need to check the profit at these intersection points:\n\n1. Profit at (100, 100): 100(100) + 50(100) = $15,000\n2. Profit at (80, 240): 100(80) + 50(240) = $20,000\n3. Profit at (80, 120): 100(80) + 50(120) = $14,000\n\nThe maximum profit is $20,000, which occurs when the company produces 80 units of product A and 240 units of product B. Therefore, the optimal production plan is to produce 80 units of product A and 240 units of product B."
}