{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Mixed-integer programming",
    "message_1": "A factory produces two types of products: product A and product B. The factory can produce up to 100 units of each product per week. The factory has a total of 500 hours of work available per week. Producing one unit of A takes 2 hours of work, while producing one unit of B takes 3 hours of work. The factory has a weekly budget of $10,000 for raw materials, and the cost of producing one unit of A is $50, while the cost of producing one unit of B is $70. The factory wants to maximize its profit.\n\nWhat is the optimal number of units of product A and product B the factory should produce per week to maximize its profit?",
    "message_2": "Let x be the number of units of product A and y be the number of units of product B.\n\nWe have the following constraints:\n\n1. Work hours constraint: 2x + 3y ≤ 500\n2. Raw materials budget constraint: 50x + 70y ≤ 10,000\n3. Production capacity constraint: x ≤ 100 and y ≤ 100\n\nWe want to maximize the profit function P(x, y) = 50x + 70y, subject to the constraints above.\n\nFirst, we will solve the work hours constraint for y:\n\ny ≤ (500 - 2x) / 3\n\nNext, we will solve the raw materials budget constraint for y:\n\ny ≤ (10,000 - 50x) / 70\n\nNow, we will graph the feasible region defined by these constraints and the production capacity constraint. The feasible region will be a polygon, and the optimal solution will occur at one of the vertices of this polygon.\n\nVertices of the feasible region:\n1. (0, 0)\n2. (0, 100)\n3. (100, 0)\n4. (x, y) where 2x + 3y = 500 and 50x + 70y = 10,000\n\nSolving the system of equations for vertex 4:\n\n2x + 3y = 500\n50x + 70y = 10,000\n\nMultiplying the first equation by 25 to make the coefficients of y equal:\n\n50x + 75y = 12,500\n50x + 70y = 10,000\n\nSubtracting the second equation from the first:\n\n5y = 2,500\ny = 500 / 5\ny = 100\n\nSubstituting y back into the first equation:\n\n2x + 3(100) = 500\n2x + 300 = 500\n2x = 200\nx = 100\n\nSo, vertex 4 is (100, 100).\n\nNow, we will evaluate the profit function P(x, y) = 50x + 70y at each vertex:\n\n1. P(0, 0) = 50(0) + 70(0) = 0\n2. P(0, 100) = 50(0) + 70(100) = 7,000\n3. P(100, 0) = 50(100) + 70(0) = 5,000\n4. P(100, 100) = 50(100) + 70(100) = 12,000\n\nThe maximum profit occurs at vertex 4, where the factory produces 100 units of product A and 100 units of product B. The maximum profit is $12,000 per week."
}