{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Optimization",
    "sub_topic": "Optimal scheduling",
    "message_1": "A furniture manufacturing company produces two types of chairs, A and B. Each chair A requires 2 hours of woodcutting and 3 hours of assembling, while each chair B needs 3 hours of woodcutting and 2 hours of assembling. The company has 90 hours of woodcutting and 80 hours of assembling available each week. If the profit for each chair A sold is $20 and each chair B is $30, how many chairs of each type should the company produce each week to maximize their profit?",
    "message_2": "Let x be the number of chairs of type A and y be the number of chairs of type B.\n\nThe constraints for the woodcutting and assembling hours are as follows:\n\nWoodcutting: 2x + 3y ≤ 90\nAssembling: 3x + 2y ≤ 80\n\nThe objective function to maximize the profit is:\n\nProfit = 20x + 30y\n\nWe will now find the feasible region by graphing the constraints:\n\n1. Rearrange the woodcutting constraint to solve for y:\n\n3y ≤ 90 - 2x\ny ≤ (90 - 2x) / 3\n\n2. Rearrange the assembling constraint to solve for y:\n\n2y ≤ 80 - 3x\ny ≤ (80 - 3x) / 2\n\nNow, we will find the vertices of the feasible region by finding the points where the constraints intersect:\n\n1. Intersection of woodcutting and assembling constraints:\n\n(90 - 2x) / 3 = (80 - 3x) / 2\n\nMultiply both sides by 6 to eliminate the fractions:\n\n2(90 - 2x) = 3(80 - 3x)\n180 - 4x = 240 - 9x\n5x = 60\nx = 12\n\nNow, substitute x back into either constraint to find y:\n\ny = (80 - 3(12)) / 2\ny = (80 - 36) / 2\ny = 44 / 2\ny = 22\n\nSo, the intersection point is (12, 22).\n\n2. Intersection of woodcutting constraint with x-axis (when y = 0):\n\n2x + 3(0) ≤ 90\n2x ≤ 90\nx = 45\n\nSo, the intersection point is (45, 0).\n\n3. Intersection of assembling constraint with y-axis (when x = 0):\n\n3(0) + 2y ≤ 80\n2y ≤ 80\ny = 40\n\nSo, the intersection point is (0, 40).\n\nNow, we will evaluate the profit function at each of the vertices:\n\n1. Profit at (12, 22):\n\nProfit = 20(12) + 30(22) = 240 + 660 = $900\n\n2. Profit at (45, 0):\n\nProfit = 20(45) + 30(0) = 900 + 0 = $900\n\n3. Profit at (0, 40):\n\nProfit = 20(0) + 30(40) = 0 + 1200 = $1200\n\nThe maximum profit occurs when the company produces 0 chairs of type A and 40 chairs of type B, resulting in a profit of $1200 per week."
}