{
    "role_1": "Mathematician_RoleType.ASSISTANT",
    "topic;": "Algebraic geometry",
    "sub_topic": "Mori theory and its applications",
    "message_1": "A math student is given the following problem on Mori theory in algebraic geometry:\n\nLet X be a smooth projective algebraic variety of dimension 2 and let L be an ample line bundle on X. Show that the Mori cone of effective divisors in X is generated by strict transforms of effective curves on X under birational maps.\n\nProvide an explicit example of a strict transform of an effective curve which generates a face of the Mori cone.",
    "message_2": "To show that the Mori cone of effective divisors in X is generated by strict transforms of effective curves on X under birational maps, we will use the Cone Theorem from Mori theory.\n\nCone Theorem: Let X be a smooth projective variety and L an ample line bundle on X. Then the Mori cone of effective divisors, denoted as NE(X), is generated by the classes of the strict transforms of effective curves on X under birational maps.\n\nProof: Since X is a smooth projective variety of dimension 2, it is a surface. By the Cone Theorem, the Mori cone NE(X) is generated by the classes of curves contracted by extremal rays of the Kleiman-Mori cone. These extremal rays correspond to birational contractions, which are either divisorial contractions or small contractions.\n\nIn the case of divisorial contractions, the contracted curve is an effective curve on X, and its strict transform under the birational map is an effective curve on the birational model. In the case of small contractions, the contracted curve is a (-1)-curve, which is an effective curve on the birational model. The strict transform of this curve under the inverse birational map is an effective curve on X.\n\nThus, in both cases, the Mori cone NE(X) is generated by the strict transforms of effective curves on X under birational maps.\n\nNow, let's provide an explicit example of a strict transform of an effective curve which generates a face of the Mori cone.\n\nExample: Let X be the blow-up of the projective plane P^2 at a point p, and let E be the exceptional divisor of the blow-up. The strict transform of a line L in P^2 not passing through p is an effective curve on X, and it generates a face of the Mori cone NE(X).\n\nTo see this, consider the birational map π: X → P^2 given by the blow-up. The inverse image of L under π is the strict transform of L, which is an effective curve on X. Moreover, the class of this strict transform generates an extremal ray of the Kleiman-Mori cone, as it corresponds to a divisorial contraction that contracts E to the point p.\n\nHence, the strict transform of L generates a face of the Mori cone NE(X)."
}